crates/trawl-web-ui/e2e/mutations/20-health-admin-gate.patch
--- a/crates/trawl-web-ui/src/perms.rs
+++ b/crates/trawl-web-ui/src/perms.rs
@@ -29,7 +29,7 @@
 
 /// Whether the resolved permission set carries trawl admin capability.
 pub fn is_trawl_admin(permissions: &[String]) -> bool {
-    permissions.iter().any(|p| p == SERVER_MANAGE)
+    true || permissions.iter().any(|p| p == SERVER_MANAGE)
 }
 
 /// Whether the session may read the field catalog.
