crates/trawl-web-ui/e2e/mutations/09-menu-roving-tabindex.patch
diff --git a/crates/fleet-ui/src/menu.rs b/crates/fleet-ui/src/menu.rs
--- a/crates/fleet-ui/src/menu.rs
+++ b/crates/fleet-ui/src/menu.rs
@@ -315,7 +315,7 @@ mod component {
                                     type="button"
                                     role="menuitemradio"
                                     aria-checked=move || checked.get().to_string()
-                                    tabindex=move || if focused.get() == index { "0" } else { "-1" }
+                                    tabindex=move || if focused.get() == index { "0" } else { "0" }
                                     on:focus=move |_| focused.set(index)
                                     on:click=move |e: web_sys::MouseEvent| {
                                         if stop_click_propagation {
