crates/trawl-web-ui/e2e/mutations/11-menu-restore-before-callback.patch
diff --git a/crates/fleet-ui/src/menu.rs b/crates/fleet-ui/src/menu.rs
--- a/crates/fleet-ui/src/menu.rs
+++ b/crates/fleet-ui/src/menu.rs
@@ -322,7 +322,7 @@ mod component {
                                         if stop_click_propagation {
                                             e.stop_propagation();
                                         }
-                                        close(MenuClose::Activate);
+                                        close(MenuClose::Outside);
                                         cb.run(());
                                     }
                                 >
