crates/trawl-web-ui/e2e/mutations/12-toast-dismiss-span.patch
diff --git a/crates/fleet-ui/src/toast/runtime.rs b/crates/fleet-ui/src/toast/runtime.rs
index 1988bf2f..3cf4888c 100644
--- a/crates/fleet-ui/src/toast/runtime.rs
+++ b/crates/fleet-ui/src/toast/runtime.rs
@@ -167,14 +167,12 @@ fn ToastItem(toast: Toast, bus: ToastBus, paused: Signal<bool>) -> impl IntoView
                 <div class="title">{toast.title}</div>
                 {toast.detail.map(|d| view! { <div class="detail">{d}</div> })}
             </div>
-            // The multiplication sign is decoration; the button's name
-            // comes from aria-label, not a spoken "times" glyph.
-            <button
-                type="button"
+            // MUTANT: the pre-ADR-0028 dismiss. Same class, same
+            // click, no role, no tabindex, no name but the glyph.
+            <span
                 class="x"
-                aria-label="Dismiss notification"
                 on:click=move |_| bus.dismiss(id)
-            ><span aria-hidden="true">"×"</span></button>
+            >"×"</span>
         </div>
     }
 }
