crates/trawl-web-ui/e2e/mutations/16-nets-anchor-prevent-default.patch
diff --git a/crates/trawl-web-ui/src/pages/nets.rs b/crates/trawl-web-ui/src/pages/nets.rs
index 0bedf13f..519dccc2 100644
--- a/crates/trawl-web-ui/src/pages/nets.rs
+++ b/crates/trawl-web-ui/src/pages/nets.rs
@@ -261,9 +261,29 @@ pub fn NetsPage() -> impl IntoView {
                                 // `push_net` uses; `prop:replace` is that call's
                                 // `replace: true`.
                                 let href = format!("/jobs/nets?net={id}&ntab=query");
+                                // MUTANT: a handle for the same navigation the href
+                                // describes, called by hand from the row's anchor.
+                                let mutant_push = push_net.clone();
                                 view! {
                                     <tr class="tbl-row" class:active=move || net_selected.get() == Some(id)>
-                                        <td class="mono"><a class="row-stretch" href=href prop:replace=true>{move || net.get().name}</a></td>
+                                        <td class="mono">
+                                            <a
+                                                class="row-stretch"
+                                                href=href
+                                                prop:replace=true
+                                                // MUTANT: the anchor cancels its own
+                                                // default action and navigates by hand,
+                                                // whatever modifier is held. A Ctrl-click
+                                                // opens the drawer on this page instead of
+                                                // going wherever the browser decides.
+                                                on:click=move |e| {
+                                                    e.prevent_default();
+                                                    mutant_push(Some(id), "query");
+                                                }
+                                            >
+                                                {move || net.get().name}
+                                            </a>
+                                        </td>
                                         // The cadence in words, with the enabled/paused
                                         // judgement beside it as a Badge rather than a
                                         // glyph the row has to explain.
