crates/trawl-web-ui/e2e/mutations/16-nets-anchor-prevent-default.patch
diff --git a/crates/trawl-web-ui/src/pages/nets.rs b/crates/trawl-web-ui/src/pages/nets.rs
index 8566e82a..81d9733e 100644
--- a/crates/trawl-web-ui/src/pages/nets.rs
+++ b/crates/trawl-web-ui/src/pages/nets.rs
@@ -331,6 +331,9 @@ pub fn NetsPage() -> impl IntoView {
                                     // `prop:replace` below is that call's
                                     // `replace: true`.
                                     let href = format!("/jobs/nets?net={id}&ntab=query");
+                                    // MUTANT: the router intercepting the
+                                    // press again.
+                                    let mutant_push = push_net.clone();
 
                                     // A windowed schedule advances its own
                                     // coverage point, so a manual run out
@@ -364,7 +367,26 @@ pub fn NetsPage() -> impl IntoView {
                                                 class:active=move || net_selected.get() == Some(id)
                                             >
                                                 <td class="mono">
-                                                <a class="row-stretch" href=href prop:replace=true>
+                                                <a
+                                                    class="row-stretch"
+                                                    href=href
+                                                    prop:replace=true
+                                                    // MUTANT: the anchor
+                                                    // cancels its own
+                                                    // default action and
+                                                    // navigates by hand,
+                                                    // whatever modifier
+                                                    // is held. A
+                                                    // Ctrl-click opens
+                                                    // the drawer on this
+                                                    // page instead of
+                                                    // going wherever the
+                                                    // browser decides.
+                                                    on:click=move |e| {
+                                                        e.prevent_default();
+                                                        mutant_push(Some(id), "query");
+                                                    }
+                                                >
                                                     {name.clone()}
                                                 </a>
                                                 </td>
