crates/trawl-web-ui/e2e/mutations/17-range-dialog-no-layer.patch
diff --git a/crates/fleet-ui/src/range_dialog.rs b/crates/fleet-ui/src/range_dialog.rs
--- a/crates/fleet-ui/src/range_dialog.rs
+++ b/crates/fleet-ui/src/range_dialog.rs
@@ -118,6 +118,13 @@
         }
     }
 
+    // Stand-in keeps the topmost guards compiling without overlay ownership.
+    #[derive(Clone, Copy)]
+    struct MutantLayer;
+    impl MutantLayer {
+        fn is_topmost(self) -> bool { true }
+    }
+
     /// Popover body: Relative (quick presets grid), Absolute (from/to inputs),
     /// Real-time (Live Tail). Click-outside via a fullscreen scrim closes it.
     #[component]
@@ -168,10 +175,8 @@
         // mouse cannot reach is the one combination that strands a keyboard
         // user (ADR-0029). Trap also earns the aria-modal="true" below, and
         // gives the panel its initial focus — the Segmented's first tab.
-        let layer =
-            crate::overlay::use_overlay_layer_with(crate::overlay::FocusPolicy::Trap, move || {
-                panel_ref.get().map(web_sys::Element::from)
-            });
+        // MUTANT: no overlay registration, focus capture, trap or restore.
+        let layer = MutantLayer;
         // Escape at the window, not on the panel: the key has to work before
         // focus has moved anywhere. use_event_listener registers its own
         // on_cleanup, so the discarded handle is deliberate. The topmost
