crates/trawl-web-ui/e2e/mutations/22-runs-filtered-window.patch
diff --git a/crates/trawl-web-ui/src/pages/runs.rs b/crates/trawl-web-ui/src/pages/runs.rs
--- a/crates/trawl-web-ui/src/pages/runs.rs
+++ b/crates/trawl-web-ui/src/pages/runs.rs
@@ -259,7 +259,7 @@
         let (fetched, returned, total) = data
             .as_ref()
             .map_or((requested.get().page, 0, 0), |(owner, r)| {
-                (owner.page, r.runs.len(), r.total)
+                (owner.page, visible_runs.get().len(), r.total)
             });
         PageWindow::new(
             fetched,
