crates/trawl-web-ui/e2e/mutations/24-palette-overlay-gate.patch
diff --git a/crates/fleet-ui/src/shell.rs b/crates/fleet-ui/src/shell.rs
--- a/crates/fleet-ui/src/shell.rs
+++ b/crates/fleet-ui/src/shell.rs
@@ -45,7 +45,7 @@ use crate::command_palette::{
     ChordFacts, CommandInput, CommandPalette, commands_from, editable_target, is_palette_chord,
     palette_available, platform_kbd_hint,
 };
-use crate::overlay::{FocusPolicy, OverlayLayer, has_layers, use_overlay_layer_with};
+use crate::overlay::{FocusPolicy, OverlayLayer, use_overlay_layer_with};
 
 use crate::sidebar::{Sidebar, SidebarGroup};
 use crate::theme::{Sidebar as SidebarPref, UiPrefs};
@@ -107,7 +107,7 @@ pub fn Shell(
         });
     });
     let open_palette = Callback::new(move |()| {
-        if !available.get_untracked() || has_layers() {
+        if !available.get_untracked() {
             return;
         }
         // A shortcut from the editor must restore to the visible trigger too.
@@ -341,7 +341,7 @@ fn install_palette_chord(
                     event.prevent_default();
                     close_palette.run(());
                 }
-            } else if !has_layers() {
+            } else {
                 event.prevent_default();
                 open_palette.run(());
             }
