crates/trawl-web-ui/e2e/mutations/28-live-snapshot-query.patch
diff --git a/crates/trawl-web-ui/src/pages/search.rs b/crates/trawl-web-ui/src/pages/search.rs
--- a/crates/trawl-web-ui/src/pages/search.rs
+++ b/crates/trawl-web-ui/src/pages/search.rs
@@ -141,13 +141,7 @@ pub fn Search() -> impl IntoView {
     // reader of `rows` below reads the "no query yet" placeholder
     // instead of the page the previous mode left behind. `effective_q`
     // still drives the stream, the export modal and the notice.
-    let snapshot_q = Memo::new(move |_| {
-        if live.get() {
-            String::new()
-        } else {
-            effective_q.get()
-        }
-    });
+    let snapshot_q = Memo::new(move |_| effective_q.get());
 
     let (query_pending, set_query_pending) = signal(false);
     let rows = rows_resource(snapshot_q, page, set_query_pending);
