crates/trawl-web-ui/e2e/mutations/28-live-snapshot-query.patch
diff --git a/crates/trawl-web-ui/src/pages/search.rs b/crates/trawl-web-ui/src/pages/search.rs
--- a/crates/trawl-web-ui/src/pages/search.rs
+++ b/crates/trawl-web-ui/src/pages/search.rs
@@ -206,13 +206,7 @@ pub fn Search() -> impl IntoView {
     // instead of the page the previous mode left behind. `effective_q`
     // still drives the stream and the notice; the export modal reads
     // `export_q`, which is the snapshot DSL in either mode.
-    let snapshot_q = Memo::new(move |_| {
-        if live.get() {
-            String::new()
-        } else {
-            effective_q.get()
-        }
-    });
+    let snapshot_q = Memo::new(move |_| effective_q.get());
 
     // How much of the result one request asks for (ADR-0037): one page
     // of a raw-event query, the whole of an aggregation. The page is an
