crates/trawl-web-ui/e2e/mutations/30-preview-known-total.patch
diff --git a/crates/trawl-web-ui/src/components/net_drawer.rs b/crates/trawl-web-ui/src/components/net_drawer.rs
index 2f5fada7..ffd96a75 100644
--- a/crates/trawl-web-ui/src/components/net_drawer.rs
+++ b/crates/trawl-web-ui/src/components/net_drawer.rs
@@ -903,7 +903,7 @@ fn ResultPreviewTable(result: QueryResult, row_count: Option<usize>) -> impl Int
             page.get(),
             PREVIEW_PAGE_SIZE,
             returned,
-            PageTotal::Known(total),
+            PageTotal::Known(returned),
             false,
         )
         .expect("preview page comes from checked pager navigation")
