crates/trawl-web-ui/e2e/mutations/32-rail-choice-from-toggle.patch
diff --git a/crates/trawl-web-ui/src/components/facet_sidebar.rs b/crates/trawl-web-ui/src/components/facet_sidebar.rs
--- a/crates/trawl-web-ui/src/components/facet_sidebar.rs
+++ b/crates/trawl-web-ui/src/components/facet_sidebar.rs
@@ -174,6 +174,8 @@ pub fn FacetSidebar(
             on:toggle=move |_| {
                 if compact.get() && let Some(panel) = panel.get() {
                     open.set(panel.has_attribute("open"));
+                } else if let Some(panel) = panel.get() {
+                    choice.choose(panel.has_attribute("open"));
                 }
             }
             on:focusin=move |_| focus_inside.set_value(true)
